garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f25q71.h
// Register: DAC2DATL
#define DAC2DATL DAC2DATL
extern volatile unsigned char           DAC2DATL            __at(0x0C0);
#ifndef _LIB_BUILD
asm("DAC2DATL equ 0C0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DAC2R                  :8;
    };
    struct {
        unsigned DAC2R0                 :1;
        unsigned DAC2R1                 :1;
        unsigned DAC2R2                 :1;
        unsigned DAC2R3                 :1;
        unsigned DAC2R4                 :1;
        unsigned DAC2R5                 :1;
        unsigned DAC2R6                 :1;
        unsigned DAC2R7                 :1;
    };
    struct {
        unsigned DAC2RL                 :8;
    };
} DAC2DATLbits_t;
extern volatile DAC2DATLbits_t DAC2DATLbits __at(0x0C0);
// bitfield macros
#define _DAC2DATL_DAC2R_POSN                                0x0
#define _DAC2DATL_DAC2R_POSITION                            0x0
#define _DAC2DATL_DAC2R_SIZE                                0x8
#define _DAC2DATL_DAC2R_LENGTH                              0x8
#define _DAC2DATL_DAC2R_MASK                                0xFF
#define _DAC2DATL_DAC2R0_POSN                               0x0
#define _DAC2DATL_DAC2R0_POSITION                           0x0
#define _DAC2DATL_DAC2R0_SIZE                               0x1
#define _DAC2DATL_DAC2R0_LENGTH                             0x1
#define _DAC2DATL_DAC2R0_MASK                               0x1
#define _DAC2DATL_DAC2R1_POSN                               0x1
#define _DAC2DATL_DAC2R1_POSITION                           0x1
#define _DAC2DATL_DAC2R1_SIZE                               0x1
#define _DAC2DATL_DAC2R1_LENGTH                             0x1
#define _DAC2DATL_DAC2R1_MASK                               0x2
#define _DAC2DATL_DAC2R2_POSN                               0x2
#define _DAC2DATL_DAC2R2_POSITION                           0x2
#define _DAC2DATL_DAC2R2_SIZE                               0x1
#define _DAC2DATL_DAC2R2_LENGTH                             0x1
#define _DAC2DATL_DAC2R2_MASK                               0x4
#define _DAC2DATL_DAC2R3_POSN                               0x3
#define _DAC2DATL_DAC2R3_POSITION                           0x3
#define _DAC2DATL_DAC2R3_SIZE                               0x1
#define _DAC2DATL_DAC2R3_LENGTH                             0x1
#define _DAC2DATL_DAC2R3_MASK                               0x8
#define _DAC2DATL_DAC2R4_POSN                               0x4
#define _DAC2DATL_DAC2R4_POSITION                           0x4
#define _DAC2DATL_DAC2R4_SIZE                               0x1
#define _DAC2DATL_DAC2R4_LENGTH                             0x1
#define _DAC2DATL_DAC2R4_MASK                               0x10
#define _DAC2DATL_DAC2R5_POSN                               0x5
#define _DAC2DATL_DAC2R5_POSITION                           0x5
#define _DAC2DATL_DAC2R5_SIZE                               0x1
#define _DAC2DATL_DAC2R5_LENGTH                             0x1
#define _DAC2DATL_DAC2R5_MASK                               0x20
#define _DAC2DATL_DAC2R6_POSN                               0x6
#define _DAC2DATL_DAC2R6_POSITION                           0x6
#define _DAC2DATL_DAC2R6_SIZE                               0x1
#define _DAC2DATL_DAC2R6_LENGTH                             0x1
#define _DAC2DATL_DAC2R6_MASK                               0x40
#define _DAC2DATL_DAC2R7_POSN                               0x7
#define _DAC2DATL_DAC2R7_POSITION                           0x7
#define _DAC2DATL_DAC2R7_SIZE                               0x1
#define _DAC2DATL_DAC2R7_LENGTH                             0x1
#define _DAC2DATL_DAC2R7_MASK                               0x80
#define _DAC2DATL_DAC2RL_POSN                               0x0
#define _DAC2DATL_DAC2RL_POSITION                           0x0
#define _DAC2DATL_DAC2RL_SIZE                               0x8
#define _DAC2DATL_DAC2RL_LENGTH                             0x8
#define _DAC2DATL_DAC2RL_MASK                               0xFF

// Register: DAC2CON
#define DAC2CON DAC2CON
extern volatile unsigned char           DAC2CON             __at(0x0C2);
#ifndef _LIB_BUILD
asm("DAC2CON equ 0C2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned NSS                    :2;
        unsigned PSS                    :2;
        unsigned OE                     :3;
        unsigned EN                     :1;
    };
    struct {
        unsigned DAC2NSS                :2;
        unsigned DAC2PSS0               :1;
        unsigned DAC2PSS1               :1;
        unsigned DAC2OE                 :3;
        unsigned DAC2EN                 :1;
    };
    struct {
        unsigned NSS0                   :1;
        unsigned                        :1;
        unsigned PSS0                   :1;
        unsigned PSS1                   :1;
        unsigned OE0                    :1;
        unsigned OE1                    :1;
    };
} DAC2CONbits_t;
extern volatile DAC2CONbits_t DAC2CONbits __at(0x0C2);
// bitfield macros
#define _DAC2CON_NSS_POSN                                   0x0
#define _DAC2CON_NSS_POSITION                               0x0
#define _DAC2CON_NSS_SIZE                                   0x2
#define _DAC2CON_NSS_LENGTH                                 0x2
#define _DAC2CON_NSS_MASK                                   0x3
#define _DAC2CON_PSS_POSN                                   0x2
#define _DAC2CON_PSS_POSITION                               0x2
#define _DAC2CON_PSS_SIZE                                   0x2
#define _DAC2CON_PSS_LENGTH                                 0x2
#define _DAC2CON_PSS_MASK                                   0xC
#define _DAC2CON_OE_POSN                                    0x4
#define _DAC2CON_OE_POSITION                                0x4
#define _DAC2CON_OE_SIZE                                    0x3
#define _DAC2CON_OE_LENGTH                                  0x3
#define _DAC2CON_OE_MASK                                    0x70
#define _DAC2CON_EN_POSN                                    0x7
#define _DAC2CON_EN_POSITION                                0x7
#define _DAC2CON_EN_SIZE                                    0x1
#define _DAC2CON_EN_LENGTH                                  0x1
#define _DAC2CON_EN_MASK                                    0x80
#define _DAC2CON_DAC2NSS_POSN                               0x0
#define _DAC2CON_DAC2NSS_POSITION                           0x0
#define _DAC2CON_DAC2NSS_SIZE                               0x2
#define _DAC2CON_DAC2NSS_LENGTH                             0x2
#define _DAC2CON_DAC2NSS_MASK                               0x3
#define _DAC2CON_DAC2PSS0_POSN                              0x2
#define _DAC2CON_DAC2PSS0_POSITION                          0x2
#define _DAC2CON_DAC2PSS0_SIZE                              0x1
#define _DAC2CON_DAC2PSS0_LENGTH                            0x1
#define _DAC2CON_DAC2PSS0_MASK                              0x4
#define _DAC2CON_DAC2PSS1_POSN                              0x3
#define _DAC2CON_DAC2PSS1_POSITION                          0x3
#define _DAC2CON_DAC2PSS1_SIZE                              0x1
#define _DAC2CON_DAC2PSS1_LENGTH                            0x1
#define _DAC2CON_DAC2PSS1_MASK                              0x8
#define _DAC2CON_DAC2OE_POSN                                0x4
#define _DAC2CON_DAC2OE_POSITION                            0x4
#define _DAC2CON_DAC2OE_SIZE                                0x3
#define _DAC2CON_DAC2OE_LENGTH                              0x3
#define _DAC2CON_DAC2OE_MASK                                0x70
#define _DAC2CON_DAC2EN_POSN                                0x7
#define _DAC2CON_DAC2EN_POSITION                            0x7
#define _DAC2CON_DAC2EN_SIZE                                0x1
#define _DAC2CON_DAC2EN_LENGTH                              0x1
#define _DAC2CON_DAC2EN_MASK                                0x80
#define _DAC2CON_NSS0_POSN                                  0x0
#define _DAC2CON_NSS0_POSITION                              0x0
#define _DAC2CON_NSS0_SIZE                                  0x1
#define _DAC2CON_NSS0_LENGTH                                0x1
#define _DAC2CON_NSS0_MASK                                  0x1
#define _DAC2CON_PSS0_POSN                                  0x2
#define _DAC2CON_PSS0_POSITION                              0x2
#define _DAC2CON_PSS0_SIZE                                  0x1
#define _DAC2CON_PSS0_LENGTH                                0x1
#define _DAC2CON_PSS0_MASK                                  0x4
#define _DAC2CON_PSS1_POSN                                  0x3
#define _DAC2CON_PSS1_POSITION                              0x3
#define _DAC2CON_PSS1_SIZE                                  0x1
#define _DAC2CON_PSS1_LENGTH                                0x1
#define _DAC2CON_PSS1_MASK                                  0x8
#define _DAC2CON_OE0_POSN                                   0x4
#define _DAC2CON_OE0_POSITION                               0x4
#define _DAC2CON_OE0_SIZE                                   0x1
#define _DAC2CON_OE0_LENGTH                                 0x1
#define _DAC2CON_OE0_MASK                                   0x10
#define _DAC2CON_OE1_POSN                                   0x5
#define _DAC2CON_OE1_POSITION                               0x5
#define _DAC2CON_OE1_SIZE                                   0x1
#define _DAC2CON_OE1_LENGTH                                 0x1
#define _DAC2CON_OE1_MASK                                   0x20

// Register: DAC3DAT
#define DAC3DAT DAC3DAT
extern volatile unsigned char           DAC3DAT             __at(0x0C3);
#ifndef _LIB_BUILD
asm("DAC3DAT equ 0C3h");
#endif

