garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f25q71.h
extern volatile DMAnDSZLbits_t DMAnDSZLbits __at(0x0EE);
// bitfield macros
#define _DMAnDSZL_DSZ_POSN                                  0x0
#define _DMAnDSZL_DSZ_POSITION                              0x0
#define _DMAnDSZL_DSZ_SIZE                                  0x8
#define _DMAnDSZL_DSZ_LENGTH                                0x8
#define _DMAnDSZL_DSZ_MASK                                  0xFF
#define _DMAnDSZL_DSZ0_POSN                                 0x0
#define _DMAnDSZL_DSZ0_POSITION                             0x0
#define _DMAnDSZL_DSZ0_SIZE                                 0x1
#define _DMAnDSZL_DSZ0_LENGTH                               0x1
#define _DMAnDSZL_DSZ0_MASK                                 0x1
#define _DMAnDSZL_DSZ1_POSN                                 0x1
#define _DMAnDSZL_DSZ1_POSITION                             0x1
#define _DMAnDSZL_DSZ1_SIZE                                 0x1
#define _DMAnDSZL_DSZ1_LENGTH                               0x1
#define _DMAnDSZL_DSZ1_MASK                                 0x2
#define _DMAnDSZL_DSZ2_POSN                                 0x2
#define _DMAnDSZL_DSZ2_POSITION                             0x2
#define _DMAnDSZL_DSZ2_SIZE                                 0x1
#define _DMAnDSZL_DSZ2_LENGTH                               0x1
#define _DMAnDSZL_DSZ2_MASK                                 0x4
#define _DMAnDSZL_DSZ3_POSN                                 0x3
#define _DMAnDSZL_DSZ3_POSITION                             0x3
#define _DMAnDSZL_DSZ3_SIZE                                 0x1
#define _DMAnDSZL_DSZ3_LENGTH                               0x1
#define _DMAnDSZL_DSZ3_MASK                                 0x8
#define _DMAnDSZL_DSZ4_POSN                                 0x4
#define _DMAnDSZL_DSZ4_POSITION                             0x4
#define _DMAnDSZL_DSZ4_SIZE                                 0x1
#define _DMAnDSZL_DSZ4_LENGTH                               0x1
#define _DMAnDSZL_DSZ4_MASK                                 0x10
#define _DMAnDSZL_DSZ5_POSN                                 0x5
#define _DMAnDSZL_DSZ5_POSITION                             0x5
#define _DMAnDSZL_DSZ5_SIZE                                 0x1
#define _DMAnDSZL_DSZ5_LENGTH                               0x1
#define _DMAnDSZL_DSZ5_MASK                                 0x20
#define _DMAnDSZL_DSZ6_POSN                                 0x6
#define _DMAnDSZL_DSZ6_POSITION                             0x6
#define _DMAnDSZL_DSZ6_SIZE                                 0x1
#define _DMAnDSZL_DSZ6_LENGTH                               0x1
#define _DMAnDSZL_DSZ6_MASK                                 0x40
#define _DMAnDSZL_DSZ7_POSN                                 0x7
#define _DMAnDSZL_DSZ7_POSITION                             0x7
#define _DMAnDSZL_DSZ7_SIZE                                 0x1
#define _DMAnDSZL_DSZ7_LENGTH                               0x1
#define _DMAnDSZL_DSZ7_MASK                                 0x80

// Register: DMAnDSZH
#define DMAnDSZH DMAnDSZH
extern volatile unsigned char           DMAnDSZH            __at(0x0EF);
#ifndef _LIB_BUILD
asm("DMAnDSZH equ 0EFh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DSZ                    :8;
    };
    struct {
        unsigned DSZ8                   :1;
        unsigned DSZ9                   :1;
        unsigned DSZ10                  :1;
        unsigned DSZ11                  :1;
    };
} DMAnDSZHbits_t;
extern volatile DMAnDSZHbits_t DMAnDSZHbits __at(0x0EF);
// bitfield macros
#define _DMAnDSZH_DSZ_POSN                                  0x0
#define _DMAnDSZH_DSZ_POSITION                              0x0
#define _DMAnDSZH_DSZ_SIZE                                  0x8
#define _DMAnDSZH_DSZ_LENGTH                                0x8
#define _DMAnDSZH_DSZ_MASK                                  0xFF
#define _DMAnDSZH_DSZ8_POSN                                 0x0
#define _DMAnDSZH_DSZ8_POSITION                             0x0
#define _DMAnDSZH_DSZ8_SIZE                                 0x1
#define _DMAnDSZH_DSZ8_LENGTH                               0x1
#define _DMAnDSZH_DSZ8_MASK                                 0x1
#define _DMAnDSZH_DSZ9_POSN                                 0x1
#define _DMAnDSZH_DSZ9_POSITION                             0x1
#define _DMAnDSZH_DSZ9_SIZE                                 0x1
#define _DMAnDSZH_DSZ9_LENGTH                               0x1
#define _DMAnDSZH_DSZ9_MASK                                 0x2
#define _DMAnDSZH_DSZ10_POSN                                0x2
#define _DMAnDSZH_DSZ10_POSITION                            0x2
#define _DMAnDSZH_DSZ10_SIZE                                0x1
#define _DMAnDSZH_DSZ10_LENGTH                              0x1
#define _DMAnDSZH_DSZ10_MASK                                0x4
#define _DMAnDSZH_DSZ11_POSN                                0x3
#define _DMAnDSZH_DSZ11_POSITION                            0x3
#define _DMAnDSZH_DSZ11_SIZE                                0x1
#define _DMAnDSZH_DSZ11_LENGTH                              0x1
#define _DMAnDSZH_DSZ11_MASK                                0x8

// Register: DMAnDSA
#define DMAnDSA DMAnDSA
extern volatile unsigned short          DMAnDSA             __at(0x0F0);
#ifndef _LIB_BUILD
asm("DMAnDSA equ 0F0h");
#endif

// Register: DMAnDSAL
#define DMAnDSAL DMAnDSAL
extern volatile unsigned char           DMAnDSAL            __at(0x0F0);
#ifndef _LIB_BUILD
asm("DMAnDSAL equ 0F0h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DSA                    :8;
    };
    struct {
        unsigned DSA0                   :1;
        unsigned DSA1                   :1;
        unsigned DSA2                   :1;
        unsigned DSA3                   :1;
        unsigned DSA4                   :1;
        unsigned DSA5                   :1;
        unsigned DSA6                   :1;
        unsigned DSA7                   :1;
    };
} DMAnDSALbits_t;
extern volatile DMAnDSALbits_t DMAnDSALbits __at(0x0F0);
// bitfield macros
#define _DMAnDSAL_DSA_POSN                                  0x0
#define _DMAnDSAL_DSA_POSITION                              0x0
#define _DMAnDSAL_DSA_SIZE                                  0x8
#define _DMAnDSAL_DSA_LENGTH                                0x8
#define _DMAnDSAL_DSA_MASK                                  0xFF
#define _DMAnDSAL_DSA0_POSN                                 0x0
#define _DMAnDSAL_DSA0_POSITION                             0x0
#define _DMAnDSAL_DSA0_SIZE                                 0x1
#define _DMAnDSAL_DSA0_LENGTH                               0x1
#define _DMAnDSAL_DSA0_MASK                                 0x1
#define _DMAnDSAL_DSA1_POSN                                 0x1
#define _DMAnDSAL_DSA1_POSITION                             0x1
#define _DMAnDSAL_DSA1_SIZE                                 0x1
#define _DMAnDSAL_DSA1_LENGTH                               0x1
#define _DMAnDSAL_DSA1_MASK                                 0x2
#define _DMAnDSAL_DSA2_POSN                                 0x2
#define _DMAnDSAL_DSA2_POSITION                             0x2
#define _DMAnDSAL_DSA2_SIZE                                 0x1
#define _DMAnDSAL_DSA2_LENGTH                               0x1
#define _DMAnDSAL_DSA2_MASK                                 0x4
#define _DMAnDSAL_DSA3_POSN                                 0x3
#define _DMAnDSAL_DSA3_POSITION                             0x3
#define _DMAnDSAL_DSA3_SIZE                                 0x1
#define _DMAnDSAL_DSA3_LENGTH                               0x1
#define _DMAnDSAL_DSA3_MASK                                 0x8
#define _DMAnDSAL_DSA4_POSN                                 0x4
#define _DMAnDSAL_DSA4_POSITION                             0x4
#define _DMAnDSAL_DSA4_SIZE                                 0x1
#define _DMAnDSAL_DSA4_LENGTH                               0x1
#define _DMAnDSAL_DSA4_MASK                                 0x10
#define _DMAnDSAL_DSA5_POSN                                 0x5
#define _DMAnDSAL_DSA5_POSITION                             0x5
#define _DMAnDSAL_DSA5_SIZE                                 0x1
#define _DMAnDSAL_DSA5_LENGTH                               0x1
#define _DMAnDSAL_DSA5_MASK                                 0x20
#define _DMAnDSAL_DSA6_POSN                                 0x6
#define _DMAnDSAL_DSA6_POSITION                             0x6
#define _DMAnDSAL_DSA6_SIZE                                 0x1
#define _DMAnDSAL_DSA6_LENGTH                               0x1
#define _DMAnDSAL_DSA6_MASK                                 0x40
#define _DMAnDSAL_DSA7_POSN                                 0x7
#define _DMAnDSAL_DSA7_POSITION                             0x7
#define _DMAnDSAL_DSA7_SIZE                                 0x1
#define _DMAnDSAL_DSA7_LENGTH                               0x1
#define _DMAnDSAL_DSA7_MASK                                 0x80

// Register: DMAnDSAH
#define DMAnDSAH DMAnDSAH
extern volatile unsigned char           DMAnDSAH            __at(0x0F1);
#ifndef _LIB_BUILD
asm("DMAnDSAH equ 0F1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DSA                    :8;
    };
    struct {
        unsigned DSA8                   :1;
        unsigned DSA9                   :1;
        unsigned DSA10                  :1;
        unsigned DSA11                  :1;
        unsigned DSA12                  :1;
        unsigned DSA13                  :1;
        unsigned DSA14                  :1;
        unsigned DSA15                  :1;
    };
} DMAnDSAHbits_t;
extern volatile DMAnDSAHbits_t DMAnDSAHbits __at(0x0F1);
// bitfield macros
#define _DMAnDSAH_DSA_POSN                                  0x0
#define _DMAnDSAH_DSA_POSITION                              0x0
#define _DMAnDSAH_DSA_SIZE                                  0x8
#define _DMAnDSAH_DSA_LENGTH                                0x8
#define _DMAnDSAH_DSA_MASK                                  0xFF
#define _DMAnDSAH_DSA8_POSN                                 0x0
#define _DMAnDSAH_DSA8_POSITION                             0x0
#define _DMAnDSAH_DSA8_SIZE                                 0x1
#define _DMAnDSAH_DSA8_LENGTH                               0x1
#define _DMAnDSAH_DSA8_MASK                                 0x1
#define _DMAnDSAH_DSA9_POSN                                 0x1
#define _DMAnDSAH_DSA9_POSITION                             0x1
#define _DMAnDSAH_DSA9_SIZE                                 0x1
#define _DMAnDSAH_DSA9_LENGTH                               0x1
#define _DMAnDSAH_DSA9_MASK                                 0x2
#define _DMAnDSAH_DSA10_POSN                                0x2
#define _DMAnDSAH_DSA10_POSITION                            0x2
#define _DMAnDSAH_DSA10_SIZE                                0x1
#define _DMAnDSAH_DSA10_LENGTH                              0x1
#define _DMAnDSAH_DSA10_MASK                                0x4
#define _DMAnDSAH_DSA11_POSN                                0x3
#define _DMAnDSAH_DSA11_POSITION                            0x3
#define _DMAnDSAH_DSA11_SIZE                                0x1
#define _DMAnDSAH_DSA11_LENGTH                              0x1
#define _DMAnDSAH_DSA11_MASK                                0x8
#define _DMAnDSAH_DSA12_POSN                                0x4
#define _DMAnDSAH_DSA12_POSITION                            0x4
#define _DMAnDSAH_DSA12_SIZE                                0x1
#define _DMAnDSAH_DSA12_LENGTH                              0x1
#define _DMAnDSAH_DSA12_MASK                                0x10
#define _DMAnDSAH_DSA13_POSN                                0x5
#define _DMAnDSAH_DSA13_POSITION                            0x5
#define _DMAnDSAH_DSA13_SIZE                                0x1
#define _DMAnDSAH_DSA13_LENGTH                              0x1
#define _DMAnDSAH_DSA13_MASK                                0x20
#define _DMAnDSAH_DSA14_POSN                                0x6
#define _DMAnDSAH_DSA14_POSITION                            0x6
#define _DMAnDSAH_DSA14_SIZE                                0x1
#define _DMAnDSAH_DSA14_LENGTH                              0x1
#define _DMAnDSAH_DSA14_MASK                                0x40
#define _DMAnDSAH_DSA15_POSN                                0x7
#define _DMAnDSAH_DSA15_POSITION                            0x7
#define _DMAnDSAH_DSA15_SIZE                                0x1
#define _DMAnDSAH_DSA15_LENGTH                              0x1
#define _DMAnDSAH_DSA15_MASK                                0x80

