garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f25q71.h
extern volatile APMPREHbits_t APMPREHbits __at(0x1C2);
// bitfield macros
#define _APMPREH_PRE_POSN                                   0x0
#define _APMPREH_PRE_POSITION                               0x0
#define _APMPREH_PRE_SIZE                                   0x8
#define _APMPREH_PRE_LENGTH                                 0x8
#define _APMPREH_PRE_MASK                                   0xFF
#define _APMPREH_PRE8_POSN                                  0x0
#define _APMPREH_PRE8_POSITION                              0x0
#define _APMPREH_PRE8_SIZE                                  0x1
#define _APMPREH_PRE8_LENGTH                                0x1
#define _APMPREH_PRE8_MASK                                  0x1
#define _APMPREH_PRE9_POSN                                  0x1
#define _APMPREH_PRE9_POSITION                              0x1
#define _APMPREH_PRE9_SIZE                                  0x1
#define _APMPREH_PRE9_LENGTH                                0x1
#define _APMPREH_PRE9_MASK                                  0x2
#define _APMPREH_PRE10_POSN                                 0x2
#define _APMPREH_PRE10_POSITION                             0x2
#define _APMPREH_PRE10_SIZE                                 0x1
#define _APMPREH_PRE10_LENGTH                               0x1
#define _APMPREH_PRE10_MASK                                 0x4
#define _APMPREH_PRE11_POSN                                 0x3
#define _APMPREH_PRE11_POSITION                             0x3
#define _APMPREH_PRE11_SIZE                                 0x1
#define _APMPREH_PRE11_LENGTH                               0x1
#define _APMPREH_PRE11_MASK                                 0x8
#define _APMPREH_PRE12_POSN                                 0x4
#define _APMPREH_PRE12_POSITION                             0x4
#define _APMPREH_PRE12_SIZE                                 0x1
#define _APMPREH_PRE12_LENGTH                               0x1
#define _APMPREH_PRE12_MASK                                 0x10
#define _APMPREH_PRE13_POSN                                 0x5
#define _APMPREH_PRE13_POSITION                             0x5
#define _APMPREH_PRE13_SIZE                                 0x1
#define _APMPREH_PRE13_LENGTH                               0x1
#define _APMPREH_PRE13_MASK                                 0x20
#define _APMPREH_PRE14_POSN                                 0x6
#define _APMPREH_PRE14_POSITION                             0x6
#define _APMPREH_PRE14_SIZE                                 0x1
#define _APMPREH_PRE14_LENGTH                               0x1
#define _APMPREH_PRE14_MASK                                 0x40
#define _APMPREH_PRE15_POSN                                 0x7
#define _APMPREH_PRE15_POSITION                             0x7
#define _APMPREH_PRE15_SIZE                                 0x1
#define _APMPREH_PRE15_LENGTH                               0x1
#define _APMPREH_PRE15_MASK                                 0x80
#define _APMPREH_APMPRE_POSN                                0x0
#define _APMPREH_APMPRE_POSITION                            0x0
#define _APMPREH_APMPRE_SIZE                                0x8
#define _APMPREH_APMPRE_LENGTH                              0x8
#define _APMPREH_APMPRE_MASK                                0xFF
#define _APMPREH_APMPRE8_POSN                               0x0
#define _APMPREH_APMPRE8_POSITION                           0x0
#define _APMPREH_APMPRE8_SIZE                               0x1
#define _APMPREH_APMPRE8_LENGTH                             0x1
#define _APMPREH_APMPRE8_MASK                               0x1
#define _APMPREH_APMPRE9_POSN                               0x1
#define _APMPREH_APMPRE9_POSITION                           0x1
#define _APMPREH_APMPRE9_SIZE                               0x1
#define _APMPREH_APMPRE9_LENGTH                             0x1
#define _APMPREH_APMPRE9_MASK                               0x2
#define _APMPREH_APMPRE10_POSN                              0x2
#define _APMPREH_APMPRE10_POSITION                          0x2
#define _APMPREH_APMPRE10_SIZE                              0x1
#define _APMPREH_APMPRE10_LENGTH                            0x1
#define _APMPREH_APMPRE10_MASK                              0x4
#define _APMPREH_APMPRE11_POSN                              0x3
#define _APMPREH_APMPRE11_POSITION                          0x3
#define _APMPREH_APMPRE11_SIZE                              0x1
#define _APMPREH_APMPRE11_LENGTH                            0x1
#define _APMPREH_APMPRE11_MASK                              0x8
#define _APMPREH_APMPRE12_POSN                              0x4
#define _APMPREH_APMPRE12_POSITION                          0x4
#define _APMPREH_APMPRE12_SIZE                              0x1
#define _APMPREH_APMPRE12_LENGTH                            0x1
#define _APMPREH_APMPRE12_MASK                              0x10
#define _APMPREH_APMPRE13_POSN                              0x5
#define _APMPREH_APMPRE13_POSITION                          0x5
#define _APMPREH_APMPRE13_SIZE                              0x1
#define _APMPREH_APMPRE13_LENGTH                            0x1
#define _APMPREH_APMPRE13_MASK                              0x20
#define _APMPREH_APMPRE14_POSN                              0x6
#define _APMPREH_APMPRE14_POSITION                          0x6
#define _APMPREH_APMPRE14_SIZE                              0x1
#define _APMPREH_APMPRE14_LENGTH                            0x1
#define _APMPREH_APMPRE14_MASK                              0x40
#define _APMPREH_APMPRE15_POSN                              0x7
#define _APMPREH_APMPRE15_POSITION                          0x7
#define _APMPREH_APMPRE15_SIZE                              0x1
#define _APMPREH_APMPRE15_LENGTH                            0x1
#define _APMPREH_APMPRE15_MASK                              0x80

// Register: APMPER
#define APMPER APMPER
extern volatile unsigned short          APMPER              __at(0x1C3);
#ifndef _LIB_BUILD
asm("APMPER equ 01C3h");
#endif

