garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f25q71.h
// Register: APMEND2
#define APMEND2 APMEND2
#ifndef __CCI__
extern volatile __uint24                APMEND2             __at(0x1D3);
#endif
#ifndef _LIB_BUILD
asm("APMEND2 equ 01D3h");
#endif

// Register: APMEND2L
#define APMEND2L APMEND2L
extern volatile unsigned char           APMEND2L            __at(0x1D3);
#ifndef _LIB_BUILD
asm("APMEND2L equ 01D3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned END2                   :8;
    };
} APMEND2Lbits_t;
extern volatile APMEND2Lbits_t APMEND2Lbits __at(0x1D3);
// bitfield macros
#define _APMEND2L_END2_POSN                                 0x0
#define _APMEND2L_END2_POSITION                             0x0
#define _APMEND2L_END2_SIZE                                 0x8
#define _APMEND2L_END2_LENGTH                               0x8
#define _APMEND2L_END2_MASK                                 0xFF

// Register: APMEND2H
#define APMEND2H APMEND2H
extern volatile unsigned char           APMEND2H            __at(0x1D4);
#ifndef _LIB_BUILD
asm("APMEND2H equ 01D4h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned END2                   :8;
    };
} APMEND2Hbits_t;
extern volatile APMEND2Hbits_t APMEND2Hbits __at(0x1D4);
// bitfield macros
#define _APMEND2H_END2_POSN                                 0x0
#define _APMEND2H_END2_POSITION                             0x0
#define _APMEND2H_END2_SIZE                                 0x8
#define _APMEND2H_END2_LENGTH                               0x8
#define _APMEND2H_END2_MASK                                 0xFF

// Register: APMEND2U
#define APMEND2U APMEND2U
extern volatile unsigned char           APMEND2U            __at(0x1D5);
#ifndef _LIB_BUILD
asm("APMEND2U equ 01D5h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned END2                   :8;
    };
} APMEND2Ubits_t;
extern volatile APMEND2Ubits_t APMEND2Ubits __at(0x1D5);
// bitfield macros
#define _APMEND2U_END2_POSN                                 0x0
#define _APMEND2U_END2_POSITION                             0x0
#define _APMEND2U_END2_SIZE                                 0x8
#define _APMEND2U_END2_LENGTH                               0x8
#define _APMEND2U_END2_MASK                                 0xFF

// Register: APMPERE2
#define APMPERE2 APMPERE2
extern volatile unsigned short          APMPERE2            __at(0x1D6);
#ifndef _LIB_BUILD
asm("APMPERE2 equ 01D6h");
#endif

// Register: APMPERE2L
#define APMPERE2L APMPERE2L
extern volatile unsigned char           APMPERE2L           __at(0x1D6);
#ifndef _LIB_BUILD
asm("APMPERE2L equ 01D6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned                        :2;
        unsigned BG                     :1;
        unsigned FVR1                   :1;
        unsigned FVR2                   :1;
        unsigned ADCD                   :1;
        unsigned ADCA                   :1;
        unsigned TEMP                   :1;
    };
    struct {
        unsigned APMPERE2               :8;
    };
    struct {
        unsigned                        :2;
        unsigned APMPERE2_2             :1;
        unsigned APMPERE2_3             :1;
        unsigned APMPERE2_4             :1;
        unsigned APMPERE2_5             :1;
        unsigned APMPERE2_6             :1;
        unsigned APMPERE2_7             :1;
    };
} APMPERE2Lbits_t;
extern volatile APMPERE2Lbits_t APMPERE2Lbits __at(0x1D6);
// bitfield macros
#define _APMPERE2L_BG_POSN                                  0x2
#define _APMPERE2L_BG_POSITION                              0x2
#define _APMPERE2L_BG_SIZE                                  0x1
#define _APMPERE2L_BG_LENGTH                                0x1
#define _APMPERE2L_BG_MASK                                  0x4
#define _APMPERE2L_FVR1_POSN                                0x3
#define _APMPERE2L_FVR1_POSITION                            0x3
#define _APMPERE2L_FVR1_SIZE                                0x1
#define _APMPERE2L_FVR1_LENGTH                              0x1
#define _APMPERE2L_FVR1_MASK                                0x8
#define _APMPERE2L_FVR2_POSN                                0x4
#define _APMPERE2L_FVR2_POSITION                            0x4
#define _APMPERE2L_FVR2_SIZE                                0x1
#define _APMPERE2L_FVR2_LENGTH                              0x1
#define _APMPERE2L_FVR2_MASK                                0x10
#define _APMPERE2L_ADCD_POSN                                0x5
#define _APMPERE2L_ADCD_POSITION                            0x5
#define _APMPERE2L_ADCD_SIZE                                0x1
#define _APMPERE2L_ADCD_LENGTH                              0x1
#define _APMPERE2L_ADCD_MASK                                0x20
#define _APMPERE2L_ADCA_POSN                                0x6
#define _APMPERE2L_ADCA_POSITION                            0x6
#define _APMPERE2L_ADCA_SIZE                                0x1
#define _APMPERE2L_ADCA_LENGTH                              0x1
#define _APMPERE2L_ADCA_MASK                                0x40
#define _APMPERE2L_TEMP_POSN                                0x7
#define _APMPERE2L_TEMP_POSITION                            0x7
#define _APMPERE2L_TEMP_SIZE                                0x1
#define _APMPERE2L_TEMP_LENGTH                              0x1
#define _APMPERE2L_TEMP_MASK                                0x80
#define _APMPERE2L_APMPERE2_POSN                            0x0
#define _APMPERE2L_APMPERE2_POSITION                        0x0
#define _APMPERE2L_APMPERE2_SIZE                            0x8
#define _APMPERE2L_APMPERE2_LENGTH                          0x8
#define _APMPERE2L_APMPERE2_MASK                            0xFF
#define _APMPERE2L_APMPERE2_2_POSN                          0x2
#define _APMPERE2L_APMPERE2_2_POSITION                      0x2
#define _APMPERE2L_APMPERE2_2_SIZE                          0x1
#define _APMPERE2L_APMPERE2_2_LENGTH                        0x1
#define _APMPERE2L_APMPERE2_2_MASK                          0x4
#define _APMPERE2L_APMPERE2_3_POSN                          0x3
#define _APMPERE2L_APMPERE2_3_POSITION                      0x3
#define _APMPERE2L_APMPERE2_3_SIZE                          0x1
#define _APMPERE2L_APMPERE2_3_LENGTH                        0x1
#define _APMPERE2L_APMPERE2_3_MASK                          0x8
#define _APMPERE2L_APMPERE2_4_POSN                          0x4
#define _APMPERE2L_APMPERE2_4_POSITION                      0x4
#define _APMPERE2L_APMPERE2_4_SIZE                          0x1
#define _APMPERE2L_APMPERE2_4_LENGTH                        0x1
#define _APMPERE2L_APMPERE2_4_MASK                          0x10
#define _APMPERE2L_APMPERE2_5_POSN                          0x5
#define _APMPERE2L_APMPERE2_5_POSITION                      0x5
#define _APMPERE2L_APMPERE2_5_SIZE                          0x1
#define _APMPERE2L_APMPERE2_5_LENGTH                        0x1
#define _APMPERE2L_APMPERE2_5_MASK                          0x20
#define _APMPERE2L_APMPERE2_6_POSN                          0x6
#define _APMPERE2L_APMPERE2_6_POSITION                      0x6
#define _APMPERE2L_APMPERE2_6_SIZE                          0x1
#define _APMPERE2L_APMPERE2_6_LENGTH                        0x1
#define _APMPERE2L_APMPERE2_6_MASK                          0x40
#define _APMPERE2L_APMPERE2_7_POSN                          0x7
#define _APMPERE2L_APMPERE2_7_POSITION                      0x7
#define _APMPERE2L_APMPERE2_7_SIZE                          0x1
#define _APMPERE2L_APMPERE2_7_LENGTH                        0x1
#define _APMPERE2L_APMPERE2_7_MASK                          0x80

// Register: APMPERE2H
#define APMPERE2H APMPERE2H
extern volatile unsigned char           APMPERE2H           __at(0x1D7);
#ifndef _LIB_BUILD
asm("APMPERE2H equ 01D7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned APMPERE2               :8;
    };
    struct {
        unsigned OPA1                   :1;
        unsigned OPA2                   :1;
        unsigned DAC1                   :1;
        unsigned DAC2                   :1;
        unsigned DAC3                   :1;
        unsigned CMP1                   :1;
        unsigned CMP2                   :1;
        unsigned ZCD                    :1;
    };
    struct {
        unsigned APMPERE2_8             :1;
        unsigned APMPERE2_9             :1;
        unsigned APMPERE2_10            :1;
        unsigned APMPERE2_11            :1;
        unsigned APMPERE2_12            :1;
        unsigned APMPERE2_13            :1;
        unsigned APMPERE2_14            :1;
        unsigned APMPERE2_15            :1;
    };
} APMPERE2Hbits_t;
extern volatile APMPERE2Hbits_t APMPERE2Hbits __at(0x1D7);
// bitfield macros
#define _APMPERE2H_APMPERE2_POSN                            0x0
#define _APMPERE2H_APMPERE2_POSITION                        0x0
#define _APMPERE2H_APMPERE2_SIZE                            0x8
#define _APMPERE2H_APMPERE2_LENGTH                          0x8
#define _APMPERE2H_APMPERE2_MASK                            0xFF
#define _APMPERE2H_OPA1_POSN                                0x0
#define _APMPERE2H_OPA1_POSITION                            0x0
#define _APMPERE2H_OPA1_SIZE                                0x1
#define _APMPERE2H_OPA1_LENGTH                              0x1
#define _APMPERE2H_OPA1_MASK                                0x1
#define _APMPERE2H_OPA2_POSN                                0x1
#define _APMPERE2H_OPA2_POSITION                            0x1
#define _APMPERE2H_OPA2_SIZE                                0x1
#define _APMPERE2H_OPA2_LENGTH                              0x1
#define _APMPERE2H_OPA2_MASK                                0x2
#define _APMPERE2H_DAC1_POSN                                0x2
#define _APMPERE2H_DAC1_POSITION                            0x2
#define _APMPERE2H_DAC1_SIZE                                0x1
#define _APMPERE2H_DAC1_LENGTH                              0x1
#define _APMPERE2H_DAC1_MASK                                0x4
#define _APMPERE2H_DAC2_POSN                                0x3
#define _APMPERE2H_DAC2_POSITION                            0x3
#define _APMPERE2H_DAC2_SIZE                                0x1
#define _APMPERE2H_DAC2_LENGTH                              0x1
#define _APMPERE2H_DAC2_MASK                                0x8
#define _APMPERE2H_DAC3_POSN                                0x4
#define _APMPERE2H_DAC3_POSITION                            0x4
#define _APMPERE2H_DAC3_SIZE                                0x1
#define _APMPERE2H_DAC3_LENGTH                              0x1
#define _APMPERE2H_DAC3_MASK                                0x10
#define _APMPERE2H_CMP1_POSN                                0x5
#define _APMPERE2H_CMP1_POSITION                            0x5
#define _APMPERE2H_CMP1_SIZE                                0x1
#define _APMPERE2H_CMP1_LENGTH                              0x1
#define _APMPERE2H_CMP1_MASK                                0x20
#define _APMPERE2H_CMP2_POSN                                0x6
#define _APMPERE2H_CMP2_POSITION                            0x6
#define _APMPERE2H_CMP2_SIZE                                0x1
#define _APMPERE2H_CMP2_LENGTH                              0x1
#define _APMPERE2H_CMP2_MASK                                0x40
#define _APMPERE2H_ZCD_POSN                                 0x7
#define _APMPERE2H_ZCD_POSITION                             0x7
#define _APMPERE2H_ZCD_SIZE                                 0x1
#define _APMPERE2H_ZCD_LENGTH                               0x1
#define _APMPERE2H_ZCD_MASK                                 0x80
#define _APMPERE2H_APMPERE2_8_POSN                          0x0
#define _APMPERE2H_APMPERE2_8_POSITION                      0x0
#define _APMPERE2H_APMPERE2_8_SIZE                          0x1
#define _APMPERE2H_APMPERE2_8_LENGTH                        0x1
#define _APMPERE2H_APMPERE2_8_MASK                          0x1
#define _APMPERE2H_APMPERE2_9_POSN                          0x1
#define _APMPERE2H_APMPERE2_9_POSITION                      0x1
#define _APMPERE2H_APMPERE2_9_SIZE                          0x1
#define _APMPERE2H_APMPERE2_9_LENGTH                        0x1
#define _APMPERE2H_APMPERE2_9_MASK                          0x2
#define _APMPERE2H_APMPERE2_10_POSN                         0x2
#define _APMPERE2H_APMPERE2_10_POSITION                     0x2
#define _APMPERE2H_APMPERE2_10_SIZE                         0x1
#define _APMPERE2H_APMPERE2_10_LENGTH                       0x1
#define _APMPERE2H_APMPERE2_10_MASK                         0x4
#define _APMPERE2H_APMPERE2_11_POSN                         0x3
#define _APMPERE2H_APMPERE2_11_POSITION                     0x3
#define _APMPERE2H_APMPERE2_11_SIZE                         0x1
#define _APMPERE2H_APMPERE2_11_LENGTH                       0x1
#define _APMPERE2H_APMPERE2_11_MASK                         0x8
#define _APMPERE2H_APMPERE2_12_POSN                         0x4
#define _APMPERE2H_APMPERE2_12_POSITION                     0x4
#define _APMPERE2H_APMPERE2_12_SIZE                         0x1
#define _APMPERE2H_APMPERE2_12_LENGTH                       0x1
#define _APMPERE2H_APMPERE2_12_MASK                         0x10
#define _APMPERE2H_APMPERE2_13_POSN                         0x5
#define _APMPERE2H_APMPERE2_13_POSITION                     0x5
#define _APMPERE2H_APMPERE2_13_SIZE                         0x1
#define _APMPERE2H_APMPERE2_13_LENGTH                       0x1
#define _APMPERE2H_APMPERE2_13_MASK                         0x20
#define _APMPERE2H_APMPERE2_14_POSN                         0x6
#define _APMPERE2H_APMPERE2_14_POSITION                     0x6
#define _APMPERE2H_APMPERE2_14_SIZE                         0x1
#define _APMPERE2H_APMPERE2_14_LENGTH                       0x1
#define _APMPERE2H_APMPERE2_14_MASK                         0x40
#define _APMPERE2H_APMPERE2_15_POSN                         0x7
#define _APMPERE2H_APMPERE2_15_POSITION                     0x7
#define _APMPERE2H_APMPERE2_15_SIZE                         0x1
#define _APMPERE2H_APMPERE2_15_LENGTH                       0x1
#define _APMPERE2H_APMPERE2_15_MASK                         0x80

// Register: APMCLK
#define APMCLK APMCLK
extern volatile unsigned char           APMCLK              __at(0x1D8);
#ifndef _LIB_BUILD
asm("APMCLK equ 01D8h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLK0                   :1;
        unsigned CLK1                   :1;
    };
    struct {
        unsigned CLK                    :8;
    };
    struct {
        unsigned APMCLK                 :8;
    };
    struct {
        unsigned APMCLK0                :1;
        unsigned APMCLK1                :1;
    };
} APMCLKbits_t;
extern volatile APMCLKbits_t APMCLKbits __at(0x1D8);
// bitfield macros
#define _APMCLK_CLK0_POSN                                   0x0
#define _APMCLK_CLK0_POSITION                               0x0
#define _APMCLK_CLK0_SIZE                                   0x1
#define _APMCLK_CLK0_LENGTH                                 0x1
#define _APMCLK_CLK0_MASK                                   0x1
#define _APMCLK_CLK1_POSN                                   0x1
#define _APMCLK_CLK1_POSITION                               0x1
#define _APMCLK_CLK1_SIZE                                   0x1
#define _APMCLK_CLK1_LENGTH                                 0x1
#define _APMCLK_CLK1_MASK                                   0x2
#define _APMCLK_CLK_POSN                                    0x0
#define _APMCLK_CLK_POSITION                                0x0
#define _APMCLK_CLK_SIZE                                    0x8
#define _APMCLK_CLK_LENGTH                                  0x8
#define _APMCLK_CLK_MASK                                    0xFF
#define _APMCLK_APMCLK_POSN                                 0x0
#define _APMCLK_APMCLK_POSITION                             0x0
#define _APMCLK_APMCLK_SIZE                                 0x8
#define _APMCLK_APMCLK_LENGTH                               0x8
#define _APMCLK_APMCLK_MASK                                 0xFF
#define _APMCLK_APMCLK0_POSN                                0x0
#define _APMCLK_APMCLK0_POSITION                            0x0
#define _APMCLK_APMCLK0_SIZE                                0x1
#define _APMCLK_APMCLK0_LENGTH                              0x1
#define _APMCLK_APMCLK0_MASK                                0x1
#define _APMCLK_APMCLK1_POSN                                0x1
#define _APMCLK_APMCLK1_POSITION                            0x1
#define _APMCLK_APMCLK1_SIZE                                0x1
#define _APMCLK_APMCLK1_LENGTH                              0x1
#define _APMCLK_APMCLK1_MASK                                0x2

// Register: APMSTATUS
#define APMSTATUS APMSTATUS
extern volatile unsigned short          APMSTATUS           __at(0x1D9);
#ifndef _LIB_BUILD
asm("APMSTATUS equ 01D9h");
#endif

