garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f25q71.h
extern volatile TU16ACRHbits_t TU16ACRHbits __at(0x3A5);
// bitfield macros
#define _TU16ACRH_CRH_POSN                                  0x0
#define _TU16ACRH_CRH_POSITION                              0x0
#define _TU16ACRH_CRH_SIZE                                  0x8
#define _TU16ACRH_CRH_LENGTH                                0x8
#define _TU16ACRH_CRH_MASK                                  0xFF
#define _TU16ACRH_CRH0_POSN                                 0x0
#define _TU16ACRH_CRH0_POSITION                             0x0
#define _TU16ACRH_CRH0_SIZE                                 0x1
#define _TU16ACRH_CRH0_LENGTH                               0x1
#define _TU16ACRH_CRH0_MASK                                 0x1
#define _TU16ACRH_CRH1_POSN                                 0x1
#define _TU16ACRH_CRH1_POSITION                             0x1
#define _TU16ACRH_CRH1_SIZE                                 0x1
#define _TU16ACRH_CRH1_LENGTH                               0x1
#define _TU16ACRH_CRH1_MASK                                 0x2
#define _TU16ACRH_CRH2_POSN                                 0x2
#define _TU16ACRH_CRH2_POSITION                             0x2
#define _TU16ACRH_CRH2_SIZE                                 0x1
#define _TU16ACRH_CRH2_LENGTH                               0x1
#define _TU16ACRH_CRH2_MASK                                 0x4
#define _TU16ACRH_CRH3_POSN                                 0x3
#define _TU16ACRH_CRH3_POSITION                             0x3
#define _TU16ACRH_CRH3_SIZE                                 0x1
#define _TU16ACRH_CRH3_LENGTH                               0x1
#define _TU16ACRH_CRH3_MASK                                 0x8
#define _TU16ACRH_CRH4_POSN                                 0x4
#define _TU16ACRH_CRH4_POSITION                             0x4
#define _TU16ACRH_CRH4_SIZE                                 0x1
#define _TU16ACRH_CRH4_LENGTH                               0x1
#define _TU16ACRH_CRH4_MASK                                 0x10
#define _TU16ACRH_CRH5_POSN                                 0x5
#define _TU16ACRH_CRH5_POSITION                             0x5
#define _TU16ACRH_CRH5_SIZE                                 0x1
#define _TU16ACRH_CRH5_LENGTH                               0x1
#define _TU16ACRH_CRH5_MASK                                 0x20
#define _TU16ACRH_CRH6_POSN                                 0x6
#define _TU16ACRH_CRH6_POSITION                             0x6
#define _TU16ACRH_CRH6_SIZE                                 0x1
#define _TU16ACRH_CRH6_LENGTH                               0x1
#define _TU16ACRH_CRH6_MASK                                 0x40
#define _TU16ACRH_CRH7_POSN                                 0x7
#define _TU16ACRH_CRH7_POSITION                             0x7
#define _TU16ACRH_CRH7_SIZE                                 0x1
#define _TU16ACRH_CRH7_LENGTH                               0x1
#define _TU16ACRH_CRH7_MASK                                 0x80
#define _TU16ACRH_TU16ACRH0_POSN                            0x0
#define _TU16ACRH_TU16ACRH0_POSITION                        0x0
#define _TU16ACRH_TU16ACRH0_SIZE                            0x1
#define _TU16ACRH_TU16ACRH0_LENGTH                          0x1
#define _TU16ACRH_TU16ACRH0_MASK                            0x1
#define _TU16ACRH_TU16ACRH1_POSN                            0x1
#define _TU16ACRH_TU16ACRH1_POSITION                        0x1
#define _TU16ACRH_TU16ACRH1_SIZE                            0x1
#define _TU16ACRH_TU16ACRH1_LENGTH                          0x1
#define _TU16ACRH_TU16ACRH1_MASK                            0x2
#define _TU16ACRH_TU16ACRH2_POSN                            0x2
#define _TU16ACRH_TU16ACRH2_POSITION                        0x2
#define _TU16ACRH_TU16ACRH2_SIZE                            0x1
#define _TU16ACRH_TU16ACRH2_LENGTH                          0x1
#define _TU16ACRH_TU16ACRH2_MASK                            0x4
#define _TU16ACRH_TU16ACRH3_POSN                            0x3
#define _TU16ACRH_TU16ACRH3_POSITION                        0x3
#define _TU16ACRH_TU16ACRH3_SIZE                            0x1
#define _TU16ACRH_TU16ACRH3_LENGTH                          0x1
#define _TU16ACRH_TU16ACRH3_MASK                            0x8
#define _TU16ACRH_TU16ACRH4_POSN                            0x4
#define _TU16ACRH_TU16ACRH4_POSITION                        0x4
#define _TU16ACRH_TU16ACRH4_SIZE                            0x1
#define _TU16ACRH_TU16ACRH4_LENGTH                          0x1
#define _TU16ACRH_TU16ACRH4_MASK                            0x10
#define _TU16ACRH_TU16ACRH5_POSN                            0x5
#define _TU16ACRH_TU16ACRH5_POSITION                        0x5
#define _TU16ACRH_TU16ACRH5_SIZE                            0x1
#define _TU16ACRH_TU16ACRH5_LENGTH                          0x1
#define _TU16ACRH_TU16ACRH5_MASK                            0x20
#define _TU16ACRH_TU16ACRH6_POSN                            0x6
#define _TU16ACRH_TU16ACRH6_POSITION                        0x6
#define _TU16ACRH_TU16ACRH6_SIZE                            0x1
#define _TU16ACRH_TU16ACRH6_LENGTH                          0x1
#define _TU16ACRH_TU16ACRH6_MASK                            0x40
#define _TU16ACRH_TU16ACRH7_POSN                            0x7
#define _TU16ACRH_TU16ACRH7_POSITION                        0x7
#define _TU16ACRH_TU16ACRH7_SIZE                            0x1
#define _TU16ACRH_TU16ACRH7_LENGTH                          0x1
#define _TU16ACRH_TU16ACRH7_MASK                            0x80
#define _TU16ACRH_TU16ACR8_POSN                             0x0
#define _TU16ACRH_TU16ACR8_POSITION                         0x0
#define _TU16ACRH_TU16ACR8_SIZE                             0x1
#define _TU16ACRH_TU16ACR8_LENGTH                           0x1
#define _TU16ACRH_TU16ACR8_MASK                             0x1
#define _TU16ACRH_TU16ACR9_POSN                             0x1
#define _TU16ACRH_TU16ACR9_POSITION                         0x1
#define _TU16ACRH_TU16ACR9_SIZE                             0x1
#define _TU16ACRH_TU16ACR9_LENGTH                           0x1
#define _TU16ACRH_TU16ACR9_MASK                             0x2
#define _TU16ACRH_TU16ACR10_POSN                            0x2
#define _TU16ACRH_TU16ACR10_POSITION                        0x2
#define _TU16ACRH_TU16ACR10_SIZE                            0x1
#define _TU16ACRH_TU16ACR10_LENGTH                          0x1
#define _TU16ACRH_TU16ACR10_MASK                            0x4
#define _TU16ACRH_TU16ACR11_POSN                            0x3
#define _TU16ACRH_TU16ACR11_POSITION                        0x3
#define _TU16ACRH_TU16ACR11_SIZE                            0x1
#define _TU16ACRH_TU16ACR11_LENGTH                          0x1
#define _TU16ACRH_TU16ACR11_MASK                            0x8
#define _TU16ACRH_TU16ACR12_POSN                            0x4
#define _TU16ACRH_TU16ACR12_POSITION                        0x4
#define _TU16ACRH_TU16ACR12_SIZE                            0x1
#define _TU16ACRH_TU16ACR12_LENGTH                          0x1
#define _TU16ACRH_TU16ACR12_MASK                            0x10
#define _TU16ACRH_TU16ACR13_POSN                            0x5
#define _TU16ACRH_TU16ACR13_POSITION                        0x5
#define _TU16ACRH_TU16ACR13_SIZE                            0x1
#define _TU16ACRH_TU16ACR13_LENGTH                          0x1
#define _TU16ACRH_TU16ACR13_MASK                            0x20
#define _TU16ACRH_TU16ACR14_POSN                            0x6
#define _TU16ACRH_TU16ACR14_POSITION                        0x6
#define _TU16ACRH_TU16ACR14_SIZE                            0x1
#define _TU16ACRH_TU16ACR14_LENGTH                          0x1
#define _TU16ACRH_TU16ACR14_MASK                            0x40
#define _TU16ACRH_TU16ACR15_POSN                            0x7
#define _TU16ACRH_TU16ACR15_POSITION                        0x7
#define _TU16ACRH_TU16ACR15_SIZE                            0x1
#define _TU16ACRH_TU16ACR15_LENGTH                          0x1
#define _TU16ACRH_TU16ACR15_MASK                            0x80

// Register: TU16APR
#define TU16APR TU16APR
extern volatile unsigned short          TU16APR             __at(0x3A6);
#ifndef _LIB_BUILD
asm("TU16APR equ 03A6h");
#endif

// Register: TU16APRL
#define TU16APRL TU16APRL
extern volatile unsigned char           TU16APRL            __at(0x3A6);
#ifndef _LIB_BUILD
asm("TU16APRL equ 03A6h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRL                    :8;
    };
    struct {
        unsigned PRL0                   :1;
        unsigned PRL1                   :1;
        unsigned PRL2                   :1;
        unsigned PRL3                   :1;
        unsigned PRL4                   :1;
        unsigned PRL5                   :1;
        unsigned PRL6                   :1;
        unsigned PRL7                   :1;
    };
    struct {
        unsigned TU16APRL0              :1;
        unsigned TU16APRL1              :1;
        unsigned TU16APRL2              :1;
        unsigned TU16APRL3              :1;
        unsigned TU16APRL4              :1;
        unsigned TU16APRL5              :1;
        unsigned TU16APRL6              :1;
        unsigned TU16APRL7              :1;
    };
    struct {
        unsigned TU16APR0               :1;
        unsigned TU16APR1               :1;
        unsigned TU16APR2               :1;
        unsigned TU16APR3               :1;
        unsigned TU16APR4               :1;
        unsigned TU16APR5               :1;
        unsigned TU16APR6               :1;
        unsigned TU16APR7               :1;
    };
} TU16APRLbits_t;
extern volatile TU16APRLbits_t TU16APRLbits __at(0x3A6);
// bitfield macros
#define _TU16APRL_PRL_POSN                                  0x0
#define _TU16APRL_PRL_POSITION                              0x0
#define _TU16APRL_PRL_SIZE                                  0x8
#define _TU16APRL_PRL_LENGTH                                0x8
#define _TU16APRL_PRL_MASK                                  0xFF
#define _TU16APRL_PRL0_POSN                                 0x0
#define _TU16APRL_PRL0_POSITION                             0x0
#define _TU16APRL_PRL0_SIZE                                 0x1
#define _TU16APRL_PRL0_LENGTH                               0x1
#define _TU16APRL_PRL0_MASK                                 0x1
#define _TU16APRL_PRL1_POSN                                 0x1
#define _TU16APRL_PRL1_POSITION                             0x1
#define _TU16APRL_PRL1_SIZE                                 0x1
#define _TU16APRL_PRL1_LENGTH                               0x1
#define _TU16APRL_PRL1_MASK                                 0x2
#define _TU16APRL_PRL2_POSN                                 0x2
#define _TU16APRL_PRL2_POSITION                             0x2
#define _TU16APRL_PRL2_SIZE                                 0x1
#define _TU16APRL_PRL2_LENGTH                               0x1
#define _TU16APRL_PRL2_MASK                                 0x4
#define _TU16APRL_PRL3_POSN                                 0x3
#define _TU16APRL_PRL3_POSITION                             0x3
#define _TU16APRL_PRL3_SIZE                                 0x1
#define _TU16APRL_PRL3_LENGTH                               0x1
#define _TU16APRL_PRL3_MASK                                 0x8
#define _TU16APRL_PRL4_POSN                                 0x4
#define _TU16APRL_PRL4_POSITION                             0x4
#define _TU16APRL_PRL4_SIZE                                 0x1
#define _TU16APRL_PRL4_LENGTH                               0x1
#define _TU16APRL_PRL4_MASK                                 0x10
#define _TU16APRL_PRL5_POSN                                 0x5
#define _TU16APRL_PRL5_POSITION                             0x5
#define _TU16APRL_PRL5_SIZE                                 0x1
#define _TU16APRL_PRL5_LENGTH                               0x1
#define _TU16APRL_PRL5_MASK                                 0x20
#define _TU16APRL_PRL6_POSN                                 0x6
#define _TU16APRL_PRL6_POSITION                             0x6
#define _TU16APRL_PRL6_SIZE                                 0x1
#define _TU16APRL_PRL6_LENGTH                               0x1
#define _TU16APRL_PRL6_MASK                                 0x40
#define _TU16APRL_PRL7_POSN                                 0x7
#define _TU16APRL_PRL7_POSITION                             0x7
#define _TU16APRL_PRL7_SIZE                                 0x1
#define _TU16APRL_PRL7_LENGTH                               0x1
#define _TU16APRL_PRL7_MASK                                 0x80
#define _TU16APRL_TU16APRL0_POSN                            0x0
#define _TU16APRL_TU16APRL0_POSITION                        0x0
#define _TU16APRL_TU16APRL0_SIZE                            0x1
#define _TU16APRL_TU16APRL0_LENGTH                          0x1
#define _TU16APRL_TU16APRL0_MASK                            0x1
#define _TU16APRL_TU16APRL1_POSN                            0x1
#define _TU16APRL_TU16APRL1_POSITION                        0x1
#define _TU16APRL_TU16APRL1_SIZE                            0x1
#define _TU16APRL_TU16APRL1_LENGTH                          0x1
#define _TU16APRL_TU16APRL1_MASK                            0x2
#define _TU16APRL_TU16APRL2_POSN                            0x2
#define _TU16APRL_TU16APRL2_POSITION                        0x2
#define _TU16APRL_TU16APRL2_SIZE                            0x1
#define _TU16APRL_TU16APRL2_LENGTH                          0x1
#define _TU16APRL_TU16APRL2_MASK                            0x4
#define _TU16APRL_TU16APRL3_POSN                            0x3
#define _TU16APRL_TU16APRL3_POSITION                        0x3
#define _TU16APRL_TU16APRL3_SIZE                            0x1
#define _TU16APRL_TU16APRL3_LENGTH                          0x1
#define _TU16APRL_TU16APRL3_MASK                            0x8
#define _TU16APRL_TU16APRL4_POSN                            0x4
#define _TU16APRL_TU16APRL4_POSITION                        0x4
#define _TU16APRL_TU16APRL4_SIZE                            0x1
#define _TU16APRL_TU16APRL4_LENGTH                          0x1
#define _TU16APRL_TU16APRL4_MASK                            0x10
#define _TU16APRL_TU16APRL5_POSN                            0x5
#define _TU16APRL_TU16APRL5_POSITION                        0x5
#define _TU16APRL_TU16APRL5_SIZE                            0x1
#define _TU16APRL_TU16APRL5_LENGTH                          0x1
#define _TU16APRL_TU16APRL5_MASK                            0x20
#define _TU16APRL_TU16APRL6_POSN                            0x6
#define _TU16APRL_TU16APRL6_POSITION                        0x6
#define _TU16APRL_TU16APRL6_SIZE                            0x1
#define _TU16APRL_TU16APRL6_LENGTH                          0x1
#define _TU16APRL_TU16APRL6_MASK                            0x40
#define _TU16APRL_TU16APRL7_POSN                            0x7
#define _TU16APRL_TU16APRL7_POSITION                        0x7
#define _TU16APRL_TU16APRL7_SIZE                            0x1
#define _TU16APRL_TU16APRL7_LENGTH                          0x1
#define _TU16APRL_TU16APRL7_MASK                            0x80
#define _TU16APRL_TU16APR0_POSN                             0x0
#define _TU16APRL_TU16APR0_POSITION                         0x0
#define _TU16APRL_TU16APR0_SIZE                             0x1
#define _TU16APRL_TU16APR0_LENGTH                           0x1
#define _TU16APRL_TU16APR0_MASK                             0x1
#define _TU16APRL_TU16APR1_POSN                             0x1
#define _TU16APRL_TU16APR1_POSITION                         0x1
#define _TU16APRL_TU16APR1_SIZE                             0x1
#define _TU16APRL_TU16APR1_LENGTH                           0x1
#define _TU16APRL_TU16APR1_MASK                             0x2
#define _TU16APRL_TU16APR2_POSN                             0x2
#define _TU16APRL_TU16APR2_POSITION                         0x2
#define _TU16APRL_TU16APR2_SIZE                             0x1
#define _TU16APRL_TU16APR2_LENGTH                           0x1
#define _TU16APRL_TU16APR2_MASK                             0x4
#define _TU16APRL_TU16APR3_POSN                             0x3
#define _TU16APRL_TU16APR3_POSITION                         0x3
#define _TU16APRL_TU16APR3_SIZE                             0x1
#define _TU16APRL_TU16APR3_LENGTH                           0x1
#define _TU16APRL_TU16APR3_MASK                             0x8
#define _TU16APRL_TU16APR4_POSN                             0x4
#define _TU16APRL_TU16APR4_POSITION                         0x4
#define _TU16APRL_TU16APR4_SIZE                             0x1
#define _TU16APRL_TU16APR4_LENGTH                           0x1
#define _TU16APRL_TU16APR4_MASK                             0x10
#define _TU16APRL_TU16APR5_POSN                             0x5
#define _TU16APRL_TU16APR5_POSITION                         0x5
#define _TU16APRL_TU16APR5_SIZE                             0x1
#define _TU16APRL_TU16APR5_LENGTH                           0x1
#define _TU16APRL_TU16APR5_MASK                             0x20
#define _TU16APRL_TU16APR6_POSN                             0x6
#define _TU16APRL_TU16APR6_POSITION                         0x6
#define _TU16APRL_TU16APR6_SIZE                             0x1
#define _TU16APRL_TU16APR6_LENGTH                           0x1
#define _TU16APRL_TU16APR6_MASK                             0x40
#define _TU16APRL_TU16APR7_POSN                             0x7
#define _TU16APRL_TU16APR7_POSITION                         0x7
#define _TU16APRL_TU16APR7_SIZE                             0x1
#define _TU16APRL_TU16APR7_LENGTH                           0x1
#define _TU16APRL_TU16APR7_MASK                             0x80

// Register: TU16APRH
#define TU16APRH TU16APRH
extern volatile unsigned char           TU16APRH            __at(0x3A7);
#ifndef _LIB_BUILD
asm("TU16APRH equ 03A7h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PRH                    :8;
    };
    struct {
        unsigned PRH0                   :1;
        unsigned PRH1                   :1;
        unsigned PRH2                   :1;
        unsigned PRH3                   :1;
        unsigned PRH4                   :1;
        unsigned PRH5                   :1;
        unsigned PRH6                   :1;
        unsigned PRH7                   :1;
    };
    struct {
        unsigned TU16APRH0              :1;
        unsigned TU16APRH1              :1;
        unsigned TU16APRH2              :1;
        unsigned TU16APRH3              :1;
        unsigned TU16APRH4              :1;
        unsigned TU16APRH5              :1;
        unsigned TU16APRH6              :1;
        unsigned TU16APRH7              :1;
    };
    struct {
        unsigned TU16APR8               :1;
        unsigned TU16APR9               :1;
        unsigned TU16APR10              :1;
        unsigned TU16APR11              :1;
        unsigned TU16APR12              :1;
        unsigned TU16APR13              :1;
        unsigned TU16APR14              :1;
        unsigned TU16APR15              :1;
    };
} TU16APRHbits_t;
