garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f25q71.h
extern volatile PIE9bits_t PIE9bits __at(0x4B0);
// bitfield macros
#define _PIE9_DMA3SCNTIE_POSN                               0x4
#define _PIE9_DMA3SCNTIE_POSITION                           0x4
#define _PIE9_DMA3SCNTIE_SIZE                               0x1
#define _PIE9_DMA3SCNTIE_LENGTH                             0x1
#define _PIE9_DMA3SCNTIE_MASK                               0x10
#define _PIE9_DMA3DCNTIE_POSN                               0x5
#define _PIE9_DMA3DCNTIE_POSITION                           0x5
#define _PIE9_DMA3DCNTIE_SIZE                               0x1
#define _PIE9_DMA3DCNTIE_LENGTH                             0x1
#define _PIE9_DMA3DCNTIE_MASK                               0x20
#define _PIE9_DMA3ORIE_POSN                                 0x6
#define _PIE9_DMA3ORIE_POSITION                             0x6
#define _PIE9_DMA3ORIE_SIZE                                 0x1
#define _PIE9_DMA3ORIE_LENGTH                               0x1
#define _PIE9_DMA3ORIE_MASK                                 0x40
#define _PIE9_DMA3AIE_POSN                                  0x7
#define _PIE9_DMA3AIE_POSITION                              0x7
#define _PIE9_DMA3AIE_SIZE                                  0x1
#define _PIE9_DMA3AIE_LENGTH                                0x1
#define _PIE9_DMA3AIE_MASK                                  0x80

// Register: PIE10
#define PIE10 PIE10
extern volatile unsigned char           PIE10               __at(0x4B1);
#ifndef _LIB_BUILD
asm("PIE10 equ 04B1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT2IE                 :1;
        unsigned CLC8IE                 :1;
        unsigned TU16BIE                :1;
        unsigned TMR4IE                 :1;
        unsigned DMA4SCNTIE             :1;
        unsigned DMA4DCNTIE             :1;
        unsigned DMA4ORIE               :1;
        unsigned DMA4AIE                :1;
    };
} PIE10bits_t;
extern volatile PIE10bits_t PIE10bits __at(0x4B1);
// bitfield macros
#define _PIE10_INT2IE_POSN                                  0x0
#define _PIE10_INT2IE_POSITION                              0x0
#define _PIE10_INT2IE_SIZE                                  0x1
#define _PIE10_INT2IE_LENGTH                                0x1
#define _PIE10_INT2IE_MASK                                  0x1
#define _PIE10_CLC8IE_POSN                                  0x1
#define _PIE10_CLC8IE_POSITION                              0x1
#define _PIE10_CLC8IE_SIZE                                  0x1
#define _PIE10_CLC8IE_LENGTH                                0x1
#define _PIE10_CLC8IE_MASK                                  0x2
#define _PIE10_TU16BIE_POSN                                 0x2
#define _PIE10_TU16BIE_POSITION                             0x2
#define _PIE10_TU16BIE_SIZE                                 0x1
#define _PIE10_TU16BIE_LENGTH                               0x1
#define _PIE10_TU16BIE_MASK                                 0x4
#define _PIE10_TMR4IE_POSN                                  0x3
#define _PIE10_TMR4IE_POSITION                              0x3
#define _PIE10_TMR4IE_SIZE                                  0x1
#define _PIE10_TMR4IE_LENGTH                                0x1
#define _PIE10_TMR4IE_MASK                                  0x8
#define _PIE10_DMA4SCNTIE_POSN                              0x4
#define _PIE10_DMA4SCNTIE_POSITION                          0x4
#define _PIE10_DMA4SCNTIE_SIZE                              0x1
#define _PIE10_DMA4SCNTIE_LENGTH                            0x1
#define _PIE10_DMA4SCNTIE_MASK                              0x10
#define _PIE10_DMA4DCNTIE_POSN                              0x5
#define _PIE10_DMA4DCNTIE_POSITION                          0x5
#define _PIE10_DMA4DCNTIE_SIZE                              0x1
#define _PIE10_DMA4DCNTIE_LENGTH                            0x1
#define _PIE10_DMA4DCNTIE_MASK                              0x20
#define _PIE10_DMA4ORIE_POSN                                0x6
#define _PIE10_DMA4ORIE_POSITION                            0x6
#define _PIE10_DMA4ORIE_SIZE                                0x1
#define _PIE10_DMA4ORIE_LENGTH                              0x1
#define _PIE10_DMA4ORIE_MASK                                0x40
#define _PIE10_DMA4AIE_POSN                                 0x7
#define _PIE10_DMA4AIE_POSITION                             0x7
#define _PIE10_DMA4AIE_SIZE                                 0x1
#define _PIE10_DMA4AIE_LENGTH                               0x1
#define _PIE10_DMA4AIE_MASK                                 0x80

// Register: PIR0
#define PIR0 PIR0
extern volatile unsigned char           PIR0                __at(0x4B2);
#ifndef _LIB_BUILD
asm("PIR0 equ 04B2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SWIF                   :1;
        unsigned HLVDIF                 :1;
        unsigned OSFIF                  :1;
        unsigned CSWIF                  :1;
        unsigned NVMIF                  :1;
        unsigned CLC1IF                 :1;
        unsigned CRCIF                  :1;
        unsigned IOCIF                  :1;
    };
} PIR0bits_t;
extern volatile PIR0bits_t PIR0bits __at(0x4B2);
// bitfield macros
#define _PIR0_SWIF_POSN                                     0x0
#define _PIR0_SWIF_POSITION                                 0x0
#define _PIR0_SWIF_SIZE                                     0x1
#define _PIR0_SWIF_LENGTH                                   0x1
#define _PIR0_SWIF_MASK                                     0x1
#define _PIR0_HLVDIF_POSN                                   0x1
#define _PIR0_HLVDIF_POSITION                               0x1
#define _PIR0_HLVDIF_SIZE                                   0x1
#define _PIR0_HLVDIF_LENGTH                                 0x1
#define _PIR0_HLVDIF_MASK                                   0x2
#define _PIR0_OSFIF_POSN                                    0x2
#define _PIR0_OSFIF_POSITION                                0x2
#define _PIR0_OSFIF_SIZE                                    0x1
#define _PIR0_OSFIF_LENGTH                                  0x1
#define _PIR0_OSFIF_MASK                                    0x4
#define _PIR0_CSWIF_POSN                                    0x3
#define _PIR0_CSWIF_POSITION                                0x3
#define _PIR0_CSWIF_SIZE                                    0x1
#define _PIR0_CSWIF_LENGTH                                  0x1
#define _PIR0_CSWIF_MASK                                    0x8
#define _PIR0_NVMIF_POSN                                    0x4
#define _PIR0_NVMIF_POSITION                                0x4
#define _PIR0_NVMIF_SIZE                                    0x1
#define _PIR0_NVMIF_LENGTH                                  0x1
#define _PIR0_NVMIF_MASK                                    0x10
#define _PIR0_CLC1IF_POSN                                   0x5
#define _PIR0_CLC1IF_POSITION                               0x5
#define _PIR0_CLC1IF_SIZE                                   0x1
#define _PIR0_CLC1IF_LENGTH                                 0x1
#define _PIR0_CLC1IF_MASK                                   0x20
#define _PIR0_CRCIF_POSN                                    0x6
#define _PIR0_CRCIF_POSITION                                0x6
#define _PIR0_CRCIF_SIZE                                    0x1
#define _PIR0_CRCIF_LENGTH                                  0x1
#define _PIR0_CRCIF_MASK                                    0x40
#define _PIR0_IOCIF_POSN                                    0x7
#define _PIR0_IOCIF_POSITION                                0x7
#define _PIR0_IOCIF_SIZE                                    0x1
#define _PIR0_IOCIF_LENGTH                                  0x1
#define _PIR0_IOCIF_MASK                                    0x80

// Register: PIR1
#define PIR1 PIR1
extern volatile unsigned char           PIR1                __at(0x4B3);
#ifndef _LIB_BUILD
asm("PIR1 equ 04B3h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INT0IF                 :1;
        unsigned ADCH1IF                :1;
        unsigned ADIF                   :1;
        unsigned ACTIF                  :1;
        unsigned C1IF                   :1;
        unsigned ADCH2IF                :1;
        unsigned ADCH3IF                :1;
        unsigned ADCH4IF                :1;
    };
} PIR1bits_t;
